//TODO: 1 ===================================
// Якщо змінна a дорівнює 10, виведіть 'Вірно', інакше виведіть 'Невірно'.


// const num = 10;


// num === 10 ? console.log("Вірно"):console.log("Невірно");

// if (num === 10) {
// 	console.log("Вірно");
// } else {
// 	console.log("Невірно");
// }






//TODO: 2 ===================================
// У змінній min лежить число від 0 до 59. Визначте у котру чверть години
// Попадає це число (у першу, другу, третю або четверту).



// const num = 60;

// if (num >= 0 && num < 15) {
// 	console.log("Перша чверть");
// } else if (num >= 15 && num < 30) {
// 	console.log("Друга чверть");
// }
//  else if (num >= 30 && num < 45) {
// 	console.log("Третя чверть");
// }
//  else if (num >= 45 && num <= 59) {
// 	console.log("Четверта чверть");
// } else {
// 	console.log("Помилка");
// }





